# Task 1 - Moodle database schema understanding

In [1]:
import pandas as pd
import psycopg2 as pg
import sqlalchemy
import matplotlib.pyplot as plt

%matplotlib inline

In [2]:
%load_ext sql

**Connecting the database to the notebook**

In [3]:
%sql postgresql://postgres:THANKFUL044@localhost:5432/moodle

'Connected: postgres@moodle'

**A SQL script to count the number of tables**

In [4]:
%%sql
SELECT COUNT(*)
FROM information_schema.tables
WHERE table_schema = 'public';

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(448,)]

**A SQL script to count the number of records in each of the tables given in the MIT section**


The most important tables are: 
- mdl_logstore_standard_log
- mdl_context
- mdl_user
- mdl_course
- mdl_modules
- mdl_course_modules
- mdl_course_modules_completion
- mdl_grade_items
- mdl_grade_grades
- mdl_grade_categories
- mdl_grade_items_history
- mdl_grade_grades_history
- mdl_grade_categories_history
- mdl_forum
- mdl_forum_discussions
- mdl_forum_posts

In [5]:
%%sql
SELECT COUNT(*)
FROM mdl_logstore_standard_log;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(417554,)]

In [6]:
%%sql
SELECT COUNT(*)
FROM mdl_context;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(4359,)]

In [7]:
%%sql
SELECT COUNT(*)
FROM mdl_user;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(1052,)]

In [8]:
%%sql
SELECT COUNT(*)
FROM mdl_course;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(15,)]

In [9]:
%%sql
SELECT COUNT(*)
FROM mdl_modules;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(26,)]

In [10]:
%%sql
SELECT COUNT(*)
FROM mdl_course_modules;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(290,)]

In [11]:
%%sql
SELECT COUNT(*)
FROM mdl_course_modules_completion;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(4483,)]

In [12]:
%%sql
SELECT COUNT(*)
FROM mdl_grade_items;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(113,)]

In [13]:
%%sql
SELECT COUNT(*)
FROM mdl_grade_grades;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(3643,)]

In [14]:
%%sql
SELECT COUNT(*)
FROM mdl_grade_categories;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(16,)]

In [15]:
%%sql
SELECT COUNT(*)
FROM mdl_grade_items_history;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(486,)]

In [16]:
%%sql
SELECT COUNT(*)
FROM mdl_grade_grades_history;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(7108,)]

In [17]:
%%sql
SELECT COUNT(*)
FROM mdl_grade_categories_history;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(46,)]

In [18]:
%%sql
SELECT COUNT(*)
FROM mdl_forum;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(34,)]

In [19]:
%%sql
SELECT COUNT(*)
FROM mdl_forum_discussions;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(23,)]

In [20]:
%%sql
SELECT COUNT(*)
FROM mdl_forum_posts;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(131,)]

**A SQL script to count the number of quiz submissions by hour of day**

In [21]:
%%sql
SELECT *
FROM mdl_logstore_standard_log
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None),
 (4, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548313994, 'web', '105.233.48.139', None),
 (5, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548319150, 'web', '41.13.254.147', None)]

In [22]:
%%sql
SELECT COUNT(id) as submission_count, EXTRACT (HOUR FROM to_timestamp (timecreated))
FROM mdl_logstore_standard_log
WHERE action='submitted' AND component='mod_quiz'
GROUP BY EXTRACT (HOUR FROM to_timestamp (timecreated));

 * postgresql://postgres:***@localhost:5432/moodle
24 rows affected.

[(29, 0.0),
 (7, 1.0),
 (14, 2.0),
 (10, 3.0),
 (18, 4.0),
 (17, 5.0),
 (34, 6.0),
 (46, 7.0),
 (69, 8.0),
 (95, 9.0),
 (88, 10.0),
 (104, 11.0),
 (90, 12.0),
 (80, 13.0),
 (68, 14.0),
 (68, 15.0),
 (70, 16.0),
 (57, 17.0),
 (55, 18.0),
 (46, 19.0),
 (53, 20.0),
 (26, 21.0),
 (23, 22.0),
 (30, 23.0)]

**A SQL script to count monthly usage time of learners who have confirmed and are not deleted**

In [23]:
%%sql
SELECT * 
FROM mdl_user
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

In [24]:
%%sql
SELECT COUNT(lastaccess - firstaccess) as usagetime, EXTRACT (MONTH FROM to_timestamp (firstaccess)) as month
FROM mdl_user
WHERE confirmed=1 AND deleted=0
GROUP BY EXTRACT (MONTH FROM to_timestamp (firstaccess));

 * postgresql://postgres:***@localhost:5432/moodle
7 rows affected.

[(58, 3.0),
 (31, 7.0),
 (450, 1.0),
 (227, 2.0),
 (27, 6.0),
 (140, 4.0),
 (111, 5.0)]

**A SQL script for count of log events per user for the following verbs: ['loggedin', 'viewed',
'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered',
'attempted', 'abandoned']**

In [25]:
%%sql
SELECT * 
FROM mdl_logstore_standard_log
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None),
 (4, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548313994, 'web', '105.233.48.139', None),
 (5, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548319150, 'web', '41.13.254.147', None)]

In [30]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='loggedin'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

In [31]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='viewed'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

In [32]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='started'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

In [33]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='submitted'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

In [34]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='uploaded'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

In [35]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='updated'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

In [36]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='searched'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

In [37]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='resumed'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(3, 4), (5, 2), (9, 1), (25, 10), (39, 4)]

In [38]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='answered'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

In [39]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='attempted'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
0 rows affected.

[]

In [40]:
%%sql 
SELECT userid, COUNT(action) as action
FROM mdl_logstore_standard_log
WHERE action='abandoned'
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(2, 5)]

In [27]:
%%sql 
SELECT userid, SUM (finalgrade) as overall_grade
FROM mdl_grade_grades
GROUP BY userid 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/moodle
5 rows affected.

[(2, None),
 (3, Decimal('200.00000')),
 (5, Decimal('400.66666')),
 (7, Decimal('200.00000')),
 (9, Decimal('636.00000'))]

In [28]:
%%sql 
SELECT COUNT(id)
FROM mdl_forum_posts;

 * postgresql://postgres:***@localhost:5432/moodle
1 rows affected.

[(131,)]